oe-rv2309/mugen-riscv_rc8/logs/fio/oe_test_fio_002/2023-10-22-13:47:11.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Sun Oct 22 13:47:18 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks=vdb
+ disk_list=($disks)
+ local_disk=vdb
+ local_disk1=
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
+ tmpfile2=/tmp/tmpkjfx4ajy
+ '[' -z '' ']'
+ tmpfile=/tmp/tmpkjfx4ajy
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Sun Oct 22 13:56:05 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Sun Oct 22 13:56:07 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -o option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -c 1 /dev/
+ grep 'items processed'
+ CHECK_RESULT 1 0 0 'fio-dedupe -c option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -c option failed'
+ LOG_ERROR 'fio-dedupe -c option failed'
+ message='fio-dedupe -c option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -c option failed'
Sun Oct 22 13:56:11 2023 - ERROR - fio-dedupe -c option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 33'
+ message='oe_test_fio_002.sh line 33'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 33'
Sun Oct 22 13:56:13 2023 - ERROR - oe_test_fio_002.sh line 33
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -B 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -B option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -B option failed'
+ LOG_ERROR 'fio-dedupe -B option failed'
+ message='fio-dedupe -B option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -B option failed'
Sun Oct 22 13:56:15 2023 - ERROR - fio-dedupe -B option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 35'
+ message='oe_test_fio_002.sh line 35'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 35'
Sun Oct 22 13:56:17 2023 - ERROR - oe_test_fio_002.sh line 35
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -p 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -p option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -p option failed'
+ LOG_ERROR 'fio-dedupe -p option failed'
+ message='fio-dedupe -p option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -p option failed'
Sun Oct 22 13:56:19 2023 - ERROR - fio-dedupe -p option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 37'
+ message='oe_test_fio_002.sh line 37'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 37'
Sun Oct 22 13:56:21 2023 - ERROR - oe_test_fio_002.sh line 37
+ '[' 0 -eq 1 ']'
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=1392: Sun Oct 22 14:02:25 2023
  write: IOPS=721, BW=2885KiB/s (2955kB/s)(1024MiB/363413msec); 0 zone resets
    slat (usec): min=553, max=71347, avg=957.12, stdev=655.80
    clat (usec): min=115, max=137149, avg=21136.01, stdev=5621.92
     lat (usec): min=1585, max=139213, avg=22093.13, stdev=5724.27
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   17], 10.00th=[   18], 20.00th=[   19],
     | 30.00th=[   19], 40.00th=[   20], 50.00th=[   20], 60.00th=[   21],
     | 70.00th=[   22], 80.00th=[   24], 90.00th=[   27], 95.00th=[   30],
     | 99.00th=[   40], 99.50th=[   47], 99.90th=[   87], 99.95th=[   96],
     | 99.99th=[  117]
   bw (  KiB/s): min= 1753, max= 3284, per=100.00%, avg=2887.26, stdev=294.04, samples=721
   iops        : min=  438, max=  821, avg=721.45, stdev=73.51, samples=721
  lat (usec)   : 250=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.12%, 20=50.07%, 50=48.39%
  lat (msec)   : 100=0.37%, 250=0.04%
  cpu          : usr=12.25%, sys=64.87%, ctx=24775, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=2885KiB/s (2955kB/s), 2885KiB/s-2885KiB/s (2955kB/s-2955kB/s), io=1024MiB (1074MB), run=363413-363413msec

Disk stats (read/write):
  vda: ios=9/263381, merge=0/35586, ticks=8/301472, in_queue=306958, util=99.70%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=959336/0, merge=0/0, ticks=1376448/0, in_queue=1376448, util=92.14%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=458/959106, merge=0/745, ticks=292/1011863, in_queue=1012156, util=91.51%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.34
Starting 30 threads

mytest: (groupid=0, jobs=30): err= 0: pid=1533: Sun Oct 22 14:09:39 2023
  read: IOPS=6357, BW=99.3MiB/s (104MB/s)(14.6GiB/151013msec)
    clat (usec): min=229, max=842162, avg=4594.76, stdev=4586.48
     lat (usec): min=231, max=842164, avg=4597.65, stdev=4586.99
    clat percentiles (usec):
     |  1.00th=[   717],  5.00th=[  1352], 10.00th=[  1860], 20.00th=[  2540],
     | 30.00th=[  2999], 40.00th=[  3425], 50.00th=[  3785], 60.00th=[  4146],
     | 70.00th=[  4621], 80.00th=[  5473], 90.00th=[  7439], 95.00th=[ 10159],
     | 99.00th=[ 21365], 99.50th=[ 27919], 99.90th=[ 49021], 99.95th=[ 62129],
     | 99.99th=[127402]
   bw (  KiB/s): min=37256, max=220065, per=100.00%, avg=103519.52, stdev=725.07, samples=8782
   iops        : min= 2316, max=13739, avg=6455.52, stdev=45.34, samples=8782
  lat (usec)   : 250=0.01%, 500=0.25%, 750=0.92%, 1000=1.37%
  lat (msec)   : 2=9.07%, 4=44.30%, 10=38.88%, 20=4.05%, 50=1.07%
  lat (msec)   : 100=0.08%, 250=0.02%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.15%, sys=6.96%, ctx=957059, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=960000,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=99.3MiB/s (104MB/s), 99.3MiB/s-99.3MiB/s (104MB/s-104MB/s), io=14.6GiB (15.7GB), run=151013-151013msec

Disk stats (read/write):
  vdb: ios=959875/0, merge=0/0, ticks=1653148/0, in_queue=1653147, util=96.89%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=520/959694, merge=0/18, ticks=287/852562, in_queue=852849, util=91.35%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/vdb,/dev/,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
Generating dellr720-day2/openeuler-4k,128k,1m-all-write,randwrite,read,randread-vdb,dev,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Sun Oct 22 14:15:14 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 3
+ test 3 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Sun Oct 22 14:15:16 2023 - ERROR - failed to execute the case.
+ exit 3
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Sun Oct 22 14:15:18 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmpkjfx4ajy ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/mugen/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmpkjfx4ajy
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Sun Oct 22 14:16:24 2023 - INFO  - Finish environment cleanup.